IDEA Open Model
Symmetry Enumeration
Compatible with IDEA StatiCa v 10.1
 The symmetry type.
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public enum Symmetry
Public Enumeration Symmetry
public enum class Symmetry
Members
Member name | Value | Description
NotAvailable | 0 |  Symmetry is not available to input.
Symmetrical | 1 |  Symmetrical input.
Asymmetrical | 2 |  Non-symmetrical input.
See Also
Reference
IdeaRS.OpenModel Namespace